import type { Katakana } from "../types/Katakana";

export const KATAKANAS: Katakana[] = [
  // Vogais
  {
    id: "a", symbol: "ア", strokeCount: 2, difficulty: "easy", template: [
      {
        points: [
          {
            "x": 0,
            "y": 0
          },
          {
            "x": 0.007022163704191313,
            "y": 0
          },
          {
            "x": 0.014702655255650567,
            "y": 0.00020288090890647277
          },
          {
            "x": 0.03225806451612897,
            "y": 0.00344897545141004
          },
          {
            "x": 0.059468948869870475,
            "y": 0.006695069993913607
          },
          {
            "x": 0.1542681588764538,
            "y": 0.009941164536417173
          },
          {
            "x": 0.25565064735571646,
            "y": 0.014404544532359564
          },
          {
            "x": 0.3855606758832565,
            "y": 0.02414282815987019
          },
          {
            "x": 0.5251261795040596,
            "y": 0.031446540880503165
          },
          {
            "x": 0.6936581084046523,
            "y": 0.031446540880503165
          },
          {
            "x": 0.8150098749177089,
            "y": 0.031446540880503165
          },
          {
            "x": 0.8325652841781873,
            "y": 0.031446540880503165
          },
          {
            "x": 0.8514373491332016,
            "y": 0.031446540880503165
          },
          {
            "x": 0.8725038402457757,
            "y": 0.031446540880503165
          },
          {
            "x": 0.8920342330480578,
            "y": 0.031446540880503165
          },
          {
            "x": 0.9095896423085362,
            "y": 0.031446540880503165
          },
          {
            "x": 0.9394338380513495,
            "y": 0.031446540880503165
          },
          {
            "x": 0.9815668202764977,
            "y": 0.031446540880503165
          },
          {
            "x": 1,
            "y": 0.033272469060661426
          },
          {
            "x": 1,
            "y": 0.036518563603164994
          },
          {
            "x": 0.9934167215273206,
            "y": 0.03976465814566851
          },
          {
            "x": 0.9828834759710336,
            "y": 0.043010752688172005
          },
          {
            "x": 0.9651086240947993,
            "y": 0.06857374721038752
          },
          {
            "x": 0.9440421329822253,
            "y": 0.10428078717792658
          },
          {
            "x": 0.915075707702436,
            "y": 0.14485696895922096
          },
          {
            "x": 0.8834759710335748,
            "y": 0.18705619801176707
          },
          {
            "x": 0.8547289883695414,
            "y": 0.2134307161696085
          },
          {
            "x": 0.826640333552776,
            "y": 0.23615337796713326
          },
          {
            "x": 0.8077682685977617,
            "y": 0.2503550415905863
          },
          {
            "x": 0.7902128593372834,
            "y": 0.26333941976060043
          },
          {
            "x": 0.7759490893131447,
            "y": 0.2732805842970176
          },
          {
            "x": 0.761904761904762,
            "y": 0.28301886792452824
          }
        ]
      },
      {
        "points": [
          {
            "x": 0.44897959183673464,
            "y": 0.20125786163522005
          },
          {
            "x": 0.4529295589203422,
            "y": 0.22682085615743555
          },
          {
            "x": 0.4568795260039498,
            "y": 0.2513694461351187
          },
          {
            "x": 0.46082949308755755,
            "y": 0.2732805842970176
          },
          {
            "x": 0.46697388632872505,
            "y": 0.2870764861026577
          },
          {
            "x": 0.4748738204959404,
            "y": 0.2943801988232907
          },
          {
            "x": 0.4794821154268159,
            "y": 0.30472712517752076
          },
          {
            "x": 0.4834320825104235,
            "y": 0.3185230269831608
          },
          {
            "x": 0.4873820495940311,
            "y": 0.35504159058632573
          },
          {
            "x": 0.4897959183673468,
            "y": 0.3944004869141814
          },
          {
            "x": 0.4897959183673468,
            "y": 0.4382227632379792
          },
          {
            "x": 0.4897959183673468,
            "y": 0.46500304321363345
          },
          {
            "x": 0.4897959183673468,
            "y": 0.48326232501521593
          },
          {
            "x": 0.4897959183673468,
            "y": 0.5084195577196184
          },
          {
            "x": 0.488040377441299,
            "y": 0.5372286467843375
          },
          {
            "x": 0.48014044327408384,
            "y": 0.5773990667478189
          },
          {
            "x": 0.468290542023261,
            "y": 0.6120917021708255
          },
          {
            "x": 0.45249067368883034,
            "y": 0.6413065530533575
          },
          {
            "x": 0.42440201887206486,
            "y": 0.6790424021099614
          },
          {
            "x": 0.39324116743471577,
            "y": 0.7188070602556298
          },
          {
            "x": 0.36954136493307,
            "y": 0.7516737674984784
          },
          {
            "x": 0.3471582181259601,
            "y": 0.7821059038344491
          },
          {
            "x": 0.3274083827079219,
            "y": 0.8076688983566647
          },
          {
            "x": 0.3100724160631994,
            "y": 0.8220734428890241
          },
          {
            "x": 0.2942725477287688,
            "y": 0.829377155609657
          },
          {
            "x": 0.27847267939433834,
            "y": 0.8399269628727934
          },
          {
            "x": 0.2626728110599078,
            "y": 0.8520998174071818
          },
          {
            "x": 0.24687294272547733,
            "y": 0.8703590992087643
          },
          {
            "x": 0.22053982883475975,
            "y": 0.8983566646378575
          },
          {
            "x": 0.1810401579986835,
            "y": 0.9385270846013388
          },
          {
            "x": 0.14154048716260678,
            "y": 0.9707851491174682
          },
          {
            "x": 0.10204081632653055,
            "y": 1
          }
        ],
      },
    ],
  },
  { id: "i", symbol: "イ", strokeCount: 2, difficulty: "easy", template: [] },
  { id: "u", symbol: "ウ", strokeCount: 3, difficulty: "easy", template: [] },
  { id: "e", symbol: "エ", strokeCount: 3, difficulty: "easy", template: [] },
  { id: "o", symbol: "オ", strokeCount: 3, difficulty: "easy", template: [] },

  // K
  { id: "ka", symbol: "カ", strokeCount: 2, difficulty: "easy", template: [] },
  { id: "ki", symbol: "キ", strokeCount: 3, difficulty: "medium", template: [] },
  { id: "ku", symbol: "ク", strokeCount: 2, difficulty: "easy", template: [] },
  { id: "ke", symbol: "ケ", strokeCount: 3, difficulty: "medium", template: [] },
  { id: "ko", symbol: "コ", strokeCount: 2, difficulty: "easy", template: [] },

  // S
  { id: "sa", symbol: "サ", strokeCount: 3, difficulty: "medium", template: [] },
  { id: "shi", symbol: "シ", strokeCount: 3, difficulty: "medium", template: [] },
  { id: "su", symbol: "ス", strokeCount: 2, difficulty: "easy", template: [] },
  { id: "se", symbol: "セ", strokeCount: 2, difficulty: "easy", template: [] },
  { id: "so", symbol: "ソ", strokeCount: 2, difficulty: "easy", template: [] },

  // T
  { id: "ta", symbol: "タ", strokeCount: 3, difficulty: "medium", template: [] },
  { id: "chi", symbol: "チ", strokeCount: 3, difficulty: "medium", template: [] },
  { id: "tsu", symbol: "ツ", strokeCount: 3, difficulty: "hard", template: [] },
  { id: "te", symbol: "テ", strokeCount: 3, difficulty: "medium", template: [] },
  { id: "to", symbol: "ト", strokeCount: 2, difficulty: "easy", template: [] },

  // N
  { id: "na", symbol: "ナ", strokeCount: 2, difficulty: "easy", template: [] },
  { id: "ni", symbol: "ニ", strokeCount: 2, difficulty: "easy", template: [] },
  { id: "nu", symbol: "ヌ", strokeCount: 2, difficulty: "medium", template: [] },
  { id: "ne", symbol: "ネ", strokeCount: 4, difficulty: "hard", template: [] },
  { id: "no", symbol: "ノ", strokeCount: 1, difficulty: "easy", template: [] },

  // H
  { id: "ha", symbol: "ハ", strokeCount: 2, difficulty: "easy", template: [] },
  { id: "hi", symbol: "ヒ", strokeCount: 2, difficulty: "medium", template: [] },
  { id: "fu", symbol: "フ", strokeCount: 1, difficulty: "easy", template: [] },
  { id: "he", symbol: "ヘ", strokeCount: 1, difficulty: "easy", template: [] },
  { id: "ho", symbol: "ホ", strokeCount: 4, difficulty: "hard", template: [] },

  // M
  { id: "ma", symbol: "マ", strokeCount: 2, difficulty: "easy", template: [] },
  { id: "mi", symbol: "ミ", strokeCount: 3, difficulty: "hard", template: [] },
  { id: "mu", symbol: "ム", strokeCount: 2, difficulty: "medium", template: [] },
  { id: "me", symbol: "メ", strokeCount: 2, difficulty: "easy", template: [] },
  { id: "mo", symbol: "モ", strokeCount: 3, difficulty: "medium", template: [] },

  // Y
  { id: "ya", symbol: "ヤ", strokeCount: 2, difficulty: "medium", template: [] },
  { id: "yu", symbol: "ユ", strokeCount: 2, difficulty: "easy", template: [] },
  { id: "yo", symbol: "ヨ", strokeCount: 3, difficulty: "easy", template: [] },

  // R
  { id: "ra", symbol: "ラ", strokeCount: 2, difficulty: "easy", template: [] },
  { id: "ri", symbol: "リ", strokeCount: 2, difficulty: "easy", template: [] },
  { id: "ru", symbol: "ル", strokeCount: 2, difficulty: "medium", template: [] },
  { id: "re", symbol: "レ", strokeCount: 1, difficulty: "easy", template: [] },
  { id: "ro", symbol: "ロ", strokeCount: 3, difficulty: "easy", template: [] },

  // W
  { id: "wa", symbol: "ワ", strokeCount: 2, difficulty: "medium", template: [] },
  { id: "wo", symbol: "ヲ", strokeCount: 3, difficulty: "hard", template: [] },

  // N
  {
    id: "n", symbol: "ン", strokeCount: 2, difficulty: "medium", template: [{
      points: [
        {
          "x": 0.15246636771300448,
          "y": 0.18644067796610167
        },
        {
          "x": 0.08520179372197305,
          "y": 0.29943502824858753
        },
        {
          "x": 0.06726457399103135,
          "y": 0.36723163841807915
        },
        {
          "x": 0.06726457399103135,
          "y": 0.423728813559322
        },
        {
          "x": 0.06726457399103135,
          "y": 0.5254237288135594
        },
        {
          "x": 0.05829596412556055,
          "y": 0.615819209039548
        },
        {
          "x": 0.06726457399103135,
          "y": 0.7683615819209039
        },
        {
          "x": 0.10762331838565019,
          "y": 0.9152542372881355
        },
        {
          "x": 0.1614349775784753,
          "y": 0.9548022598870056
        },
        {
          "x": 0.23766816143497754,
          "y": 0.9830508474576272
        },
        {
          "x": 0.34080717488789236,
          "y": 1
        },
        {
          "x": 0.515695067264574,
          "y": 0.943502824858757
        },
        {
          "x": 0.7264573991031391,
          "y": 0.8135593220338982
        },
        {
          "x": 0.865470852017937,
          "y": 0.6949152542372881
        },
        {
          "x": 0.9686098654708519,
          "y": 0.5536723163841808
        },
        {
          "x": 1,
          "y": 0.3107344632768362
        },
        {
          "x": 0.9775784753363228,
          "y": 0.14124293785310735
        },
        {
          "x": 0.9192825112107623,
          "y": 0.07909604519774015
        },
        {
          "x": 0.8430493273542602,
          "y": 0.05084745762711866
        },
        {
          "x": 0.7757847533632287,
          "y": 0.028248587570621493
        },
        {
          "x": 0.695067264573991,
          "y": 0.011299435028248584
        },
        {
          "x": 0.6188340807174887,
          "y": 0
        },
        {
          "x": 0.5246636771300447,
          "y": 0
        },
        {
          "x": 0.4573991031390135,
          "y": 0
        },
        {
          "x": 0.37668161434977576,
          "y": 0.028248587570621493
        },
        {
          "x": 0.23766816143497754,
          "y": 0.10734463276836165
        },
        {
          "x": 0.17040358744394618,
          "y": 0.15254237288135597
        },
        {
          "x": 0.15246636771300448,
          "y": 0.15819209039548018
        },
        {
          "x": 0.06726457399103135,
          "y": 0.21468926553672316
        },
        {
          "x": 0.01345291479820625,
          "y": 0.27118644067796616
        },
        {
          "x": 0.00448430493273545,
          "y": 0.33898305084745767
        },
        {
          "x": 0,
          "y": 0.4124293785310735
        }
      ],
    },]
  },
];